## Merging & Joining Data
Often, data is split across multiple tables or files. Pandas lets you combine them just like SQL â€” or even more flexibly!

### Sample DataFrames

In [18]:
import pandas as pd
employees = pd.DataFrame({
   "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [20]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [22]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [24]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

### Merge Like SQL: pd.merge()
Inner Join (default)

In [26]:
pd.merge(employees,departments,on="DeptID")# inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

#### Left Join

In [28]:
pd.merge(employees,departments,on="DeptID",how="left")# left join means i want all the rows from left df

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

#### Right Join

In [30]:
pd.merge(employees,departments,on="DeptID",how = "right")# right join means i want all the rows from right df

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

#### Outer Join

In [32]:
pd.merge(employees,departments,on="DeptID",how = "outer")# outer join means i want all the rows(union)

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

### Concatenating DataFrames
Use pd.concat() to stack datasets either vertically or horizontally.

In [50]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"Score":[456,686]})
df1

    Name  Score
0  Alice    456
1    Bob    686

In [48]:
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"Age":[43,34]})
df2

      Name  Age
0  Charlie   43
1    David   34

In [52]:
pd.concat([df1,df2])

      Name  Score   Age
0    Alice  456.0   NaN
1      Bob  686.0   NaN
0  Charlie    NaN  43.0
1    David    NaN  34.0

### Vertical (rows)

In [54]:
pd.concat([df1,df2])# this vertical form

      Name  Score   Age
0    Alice  456.0   NaN
1      Bob  686.0   NaN
0  Charlie    NaN  43.0
1    David    NaN  34.0

### Horizontal (columns)

In [56]:
pd.concat([df1,df2],axis = 1)

    Name  Score     Name  Age
0  Alice    456  Charlie   43
1    Bob    686    David   34

## When to Use What?
Use Case--------------------------------------Method

SQL-style joins (merge keys)-------------------pd.merge() or .join()

Stack datasets vertically----------------------	pd.concat([df1, df2])

Combine different features side-by-side-----------------	pd.concat([df1, df2], axis=1)

Align on index------------------------	.join() or merge with right_index=True

### Summary
- Use merge() like SQL joins (inner, left, right, outer)
- Use concat() to stack DataFrames (rows or columns)
- Handle mismatched keys and indexes with care
- Merging and joining are essential for real-world projects